**Требуется решить задачу:**

    Написать программу, которая из имеющегося массива строк формирует массив из строк,
    длина которых меньше либо равна 3 символа.
    Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма.
    При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

**Пример выполнения:**

    ["hello", "2", "world", ":-)"] -> ["2", ":-)"]

    ["1234", "1567", "-2", "computer science"] -> ["-2"]

    ["Russia", "Denmark", "Kazan"] -> []

Для решения задачит нам потребуется 1 массив и пара циклов для заполнения и вывода данных.

Итак, запросим пользователя ввести размер массива и запишем это значение в переменную n:

    Console.WriteLine("Задайте размер массива: ");
    int n = Convert.ToInt32(Console.ReadLine());

На следующем шаге необходимо заполнить массив значениями.
Для этого создадим цикл для поэлементного заполнения:

    Console.WriteLine("\nВведите массив данных: ");
    string[] strArray = new string[n];
        
    for(int i = 0; i < n; i++)
        {
        strArray[i] = Console.ReadLine();
        }

Создадим метод для вывода в консоль получившегося массива

    public static void PrintArray(string[] someArray)
    {
        Console.WriteLine("Введенный массив: [ '" + string.Join("', '", someArray) + "' ]");
    }

Создадим метод для отбора значений массива по условию задачи:
_...массив из строк, длина которых меньше либо равна 3 символа._

    public static void PrintShortedArray(string[] someArray)
    {
        Console.Write("Итоговый массив: [ ");
        for (int i = 0; i < someArray.Length; i++)
        {
            if(someArray[i].Length <= 3)
                {
                    Console.Write($"'{someArray[i]}' ");
                }
        }
        Console.Write("]");
    }

Вызовем оба метода для наглядного вывода результатов

        // Печатаем оригинальный массив
        PrintArray(strArray);

        // Печатаем итоговый массив
        PrintShortedArray(strArray);
