// 1. Напишите программу, которая принимает на вход число N
// и выдаёт произведение чисел от 1 до N.
// 4 -> 24
// 5 -> 120 

namespace Seminar_4
{
    class Program
    {
        public static void Main(string[] args)
        {
        
        Console.WriteLine("Input Digit");
        
        int number = Convert.ToInt32(Console.ReadLine());

        int[] a = s.Split(' ');    
            
        }

    }
}